
&НаСервере
// Процедура обработки события пользовательских настроек отчета на сервере.
// В случае если форме заполнили параметр ЗапускТеста, передает значение параметра отчету.
//
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	ЗапускТеста = Неопределено;
	
	Параметры.Свойство("ЗапускТеста", ЗапускТеста);
	
	Если ЗапускТеста <> Неопределено Тогда  
		
		Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			
			Если ТипЗнч(ЭлементНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастроек.Параметр = Новый ПараметрКомпоновкиДанных("ЗапускТеста") Тогда
				
				ЭлементНастроек.Значение = Параметры.ЗапускТеста;
				ЭлементНастроек.Использование = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

