&НаКлиенте
Перем мКонтекст;


&НаКлиенте
// Обработчик открытия формы
//
Процедура ПриОткрытии(Отказ)
	
	Попытка
		мКонтекст = ТЦКлиент.СоздатьКонтекстВРМ(
			Параметры.Клиент,
			Параметры.Пользователь,
			Параметры.ВП);
		УстановитьСсылкуВРМ(Параметры.ВП);
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
	КонецПопытки;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Обработчик закрытия формы
//
Процедура ПриЗакрытии()
	
	Попытка
		ТЦКлиент.УдалитьКонтекстВРМ(мКонтекст);
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
	КонецПопытки;
	
КонецПроцедуры // ПриЗакрытии()

&НаКлиенте
// Обработчик приема локальных сообщений
//
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Попытка
		Если ТЦКлиент.ОбработатьСообщениеВРМ(мКонтекст, Данные) Тогда
			ОбновитьВРМ();
		КонецЕсли;
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
		
		Если мКонтекст.Сообщения <> Неопределено Тогда
			ПараметрыОтветаВРМ = ТЦКлиент.ПараметрыОтветаВРМ(мКонтекст.ВРМ);
			ПараметрыОтветаВРМ.Результат = "ВРМ не смог обработать сообщение Агента";
			ТЦКлиент.ОтправитьАгенту(
				мКонтекст,
				мКонтекст.Перечисления.ТЦСообщение.ВыполненоСОшибкой,
				ПараметрыОтветаВРМ);
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры // ВнешнееСобытие()

&НаСервере
// 
//
// Параметры:
//  
//
Процедура УстановитьСсылкуВРМ(Ссылка)
	
	ТекущийОбъект = Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры // УстановитьСсылкуВРМ()

&НаСервере
// 
//
// Параметры:
//  
//
Процедура ОбновитьВРМ()
	
	НачатьТранзакцию();
	Прочитать();
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ОбновитьВРМ()

&НаКлиенте
Процедура ЗакрытьВРМ(Команда)
	
	ЗавершитьРаботуСистемы();
	
КонецПроцедуры
